rico001/bambuddy-screen-4848S040CI-esp32/src/settings_screen.cpp
static int screen_off_idx = SCREEN_OFF_DEFAULT;
static int saver_idx = SAVER_DEFAULT;
static screen_level_t screen_level = SCREEN_ON;
static lv_obj_t *sleep_catcher = nullptr;
static lv_timer_t *sleep_timer = nullptr;
static lv_obj_t *screen_off_dd;
static lv_obj_t *saver_dd;

static bool ntp_requested = false;
static uint32_t last_ntp_attempt_ms = 0;
static lv_timer_t *time_timer = nullptr;

static Preferences prefs;

// --- Textzeilen ---
#define MAX_TEXT_ROWS 16

struct text_row_t {
    const char *title;
    settings_get_fn get;
    settings_set_fn set;
    bool masked;
    bool numeric;
    lv_obj_t *value_lbl;
};

static text_row_t text_rows[MAX_TEXT_ROWS];
static int text_row_count = 0;

// --- Editor-Overlay ---
static lv_obj_t *edit_overlay = nullptr;
static lv_obj_t *edit_title;
static lv_obj_t *edit_ta;
static lv_obj_t *edit_kb;
static int edit_row_idx = -1;

// ============================================================
// Persistenz
// ============================================================

static void load_settings()
{
    prefs.begin("settings", true);
    dark_mode = prefs.getBool("dark", true);
    primary_color = (uint32_t)prefs.getUInt("primary", COL_PRIMARY_DEFAULT);
    tls_verify = prefs.getBool("tls", true);
    start_guard = prefs.getBool("startguard", true);
    log_print_start = prefs.getBool("logstart", true);
    log_print_done = prefs.getBool("logdone", true);
    log_errors = prefs.getBool("logerr", true);
    log_boot = prefs.getBool("logboot", true);
    log_persist = prefs.getBool("logpersist", true);
    ota_web = prefs.getBool("otaweb", false);
    brightness = prefs.getInt("bright", 100);
    poll_idx = prefs.getInt("poll", POLL_DEFAULT);
    tz_idx = prefs.getInt("tz", TZ_DEFAULT);
    screen_off_idx = prefs.getInt("scroff", SCREEN_OFF_DEFAULT);
    saver_idx = prefs.getInt("saver", SAVER_DEFAULT);
    prefs.end();

    if (saver_idx < 0 || saver_idx >= SAVER_COUNT) saver_idx = SAVER_DEFAULT;

    if (screen_off_idx < 0 || screen_off_idx >= SCREEN_OFF_COUNT) {
        screen_off_idx = SCREEN_OFF_DEFAULT;
    }

    if (poll_idx < 0 || poll_idx >= POLL_COUNT) poll_idx = POLL_DEFAULT;
    if (tz_idx < 0 || tz_idx >= TZ_COUNT) tz_idx = TZ_DEFAULT;
    if (brightness < 0 || brightness > 100) brightness = 100;
}

static void save_settings()
{
    prefs.begin("settings", false);
    prefs.putBool("dark", dark_mode);
    prefs.putUInt("primary", primary_color);
    prefs.putBool("tls", tls_verify);
    prefs.putBool("startguard", start_guard);
    prefs.putBool("logstart", log_print_start);
    prefs.putBool("logdone", log_print_done);
    prefs.putBool("logerr", log_errors);
    prefs.putBool("logboot", log_boot);
    prefs.putBool("logpersist", log_persist);
    prefs.putBool("otaweb", ota_web);
    prefs.putInt("bright", brightness);
    prefs.putInt("poll", poll_idx);
    prefs.putInt("tz", tz_idx);
    prefs.putInt("scroff", screen_off_idx);
    prefs.putInt("saver", saver_idx);
    prefs.end();
}

// ============================================================
// Theme / Helligkeit / Zeit
// ============================================================

// lv_theme_default_init() initialisiert die Theme-Styles an Ort und Stelle neu
// und ruft lv_obj_report_style_change(NULL) auf, sobald das Theme bereits am
// Display haengt. Dadurch faerben sich auch bestehende Objekte sofort um —
// ein Neustart ist nicht noetig. Ausnahme: fest gesetzte Farben in eigenem
// Code (Akzent-, Warn- und Fehlerfarben) bleiben wie sie sind.
static void apply_theme()
{
    lv_display_t *disp = lv_display_get_default();
    // Die beiden Farben des Themes aus den eigenen Token statt aus LVGLs
    // Palette: Sonst faerbt das Theme Schalter und Regler in einem Blau, das
    // neben COL_ACCENT knapp danebenliegt — und knapp daneben faellt mehr auf
    // als deutlich anders.
    lv_theme_t *th = lv_theme_default_init(disp,
                                           lv_color_hex(COL_ACCENT),
                                           lv_color_hex(COL_ERR),
                                           dark_mode,
                                           LV_FONT_DEFAULT);
    lv_display_set_theme(disp, th);
}

// Regler 0-100 auf 20-100% echte Helligkeit abbilden: ganz dunkel waere ein
// scheinbar totes Geraet, aus dem man sich nicht mehr herausklicken kann.
static float brightness_to_backlight(int value)
{
    return (20.0f + value * 0.8f) / 100.0f;
}

// Setzt die Hintergrundbeleuchtung nur, wenn sie sich wirklich aendert. Der
// Schlafwaechter laeuft alle 500 ms und wuerde den Wert sonst zweimal pro
// Sekunde erneut an den Treiber schicken.
static float applied_backlight = -1.0f;

static void set_backlight(float value)
{
    if (value == applied_backlight) return;
    applied_backlight = value;
    smartdisplay_lcd_set_backlight(value);
}

static void apply_brightness()
{
    set_backlight(brightness_to_backlight(brightness));
}

// Helligkeit des Bildschirmschoners nach Tageszeit. Wird laufend nachgezogen,
// denn er laeuft womoeglich stundenlang und ueberschreitet dabei die Grenze.
static float saver_backlight()
{
    const time_t now = time(nullptr);
    struct tm tm_now;
    localtime_r(&now, &tm_now);

    const bool night = tm_now.tm_hour >= NIGHT_FROM_HOUR || tm_now.tm_hour < NIGHT_TO_HOUR;
    return night ? SAVER_BACKLIGHT_NIGHT : SAVER_BACKLIGHT;
}

// ============================================================
// Bildschirmabschaltung
// ============================================================

static void wake_cb(lv_event_t *);

// Im Schlaf legt sich eine unsichtbare Flaeche ueber alles. Sie verschluckt
// die Weckberuehrung — ohne sie wuerde der erste Tipp auf den dunklen
// Bildschirm blind auf dem darunterliegenden Screen landen, und das kann im
// schlimmsten Fall einen Druck stoppen. Beim blossen Abdunkeln bleibt sie
// weg: da ist noch alles lesbar, und Tippen soll normal wirken.
static void set_catcher(bool active)
{
    if (active && !sleep_catcher) {
        sleep_catcher = lv_obj_create(lv_layer_top());
        lv_obj_set_size(sleep_catcher, SCREEN_W, SCREEN_H);
        lv_obj_align(sleep_catcher, LV_ALIGN_TOP_LEFT, 0, 0);
        lv_obj_set_style_bg_opa(sleep_catcher, LV_OPA_TRANSP, 0);
        lv_obj_set_style_border_width(sleep_catcher, 0, 0);
        lv_obj_set_style_radius(sleep_catcher, 0, 0);
        lv_obj_remove_flag(sleep_catcher, LV_OBJ_FLAG_SCROLLABLE);
        lv_obj_add_flag(sleep_catcher, LV_OBJ_FLAG_CLICKABLE);
        lv_obj_add_event_cb(sleep_catcher, wake_cb, LV_EVENT_PRESSED, nullptr);
    }
    if (!sleep_catcher) return;

    if (active) {
        lv_obj_remove_flag(sleep_catcher, LV_OBJ_FLAG_HIDDEN);
        lv_obj_move_foreground(sleep_catcher);
    } else {
        lv_obj_add_flag(sleep_catcher, LV_OBJ_FLAG_HIDDEN);
    }
}

static void set_screen_level(screen_level_t level)
{
    if (level == screen_level) return;
    screen_level = level;

