rico001/bambuddy-screen-4848S040CI-esp32/src/settings_screen.cpp
    switch (level) {
    case SCREEN_OFF:
        // Mit Bildschirmschoner wird nicht abgeschaltet, sondern umgeschaltet.
        // Ohne gestellte Uhr bleibt es bei der Abschaltung — eine erfundene
        // Uhrzeit gross ins Zimmer zu leuchten waere schlimmer als ein
        // dunkler Bildschirm.
        if (screensaver_mode_available((screensaver_mode_t)saver_idx)) {
            screensaver_show((screensaver_mode_t)saver_idx);
            set_catcher(true); // Weckflaeche ueber den Schoner legen
            set_backlight(saver_backlight());
            break;
        }
        screensaver_show(SCREENSAVER_OFF);
        set_catcher(true);
        set_backlight(0.0f);
        break;
    case SCREEN_DIM:
        screensaver_show(SCREENSAVER_OFF);
        set_catcher(false);
        set_backlight(DIM_BACKLIGHT);
        break;
    case SCREEN_ON:
    default:
        screensaver_show(SCREENSAVER_OFF);
        set_catcher(false);
        set_backlight(brightness_to_backlight(brightness));
        break;
    }
}

static void wake_cb(lv_event_t *)
{
    set_screen_level(SCREEN_ON);
}

void settings_screen_wake()
{
    // Nicht nur einschalten, sondern auch die Untaetigkeitsuhr anstossen:
    // Ohne das haette der Schlafwaechter 500 ms spaeter wieder abgedunkelt,
    // weil er allein die Zeit seit der letzten Beruehrung kennt. Zugleich
    // laeuft die Abschaltzeit dadurch neu — der Bildschirm bleibt so lange
    // an, wie er es nach einer Beruehrung auch bliebe.
    lv_display_trigger_activity(nullptr);
    set_screen_level(SCREEN_ON);
}

static void sleep_check_cb(lv_timer_t *)
{
    const uint32_t timeout = screen_off_ms[screen_off_idx];
    if (timeout == 0) {
        set_screen_level(SCREEN_ON); // Einstellung im Schlaf abgeschaltet
        return;
    }

    // LVGL zaehlt die Zeit seit der letzten Eingabe selbst mit — dadurch
    // zaehlt jede Beruehrung auf jedem Screen, ohne dass die Screens etwas
    // davon wissen muessen.
    const uint32_t idle = lv_display_get_inactive_time(nullptr);
    const uint32_t dim_at = timeout > DIM_LEAD_MS ? timeout - DIM_LEAD_MS : timeout / 2;

    if (idle >= timeout) {
        set_screen_level(SCREEN_OFF);
        // Der Schoner laeuft womoeglich stundenlang. set_screen_level()
        // greift nur beim Wechsel, die Nachtabsenkung braucht aber einen
        // Blick auf die Uhrzeit — der gehoert hierher.
        if (screensaver_visible()) set_backlight(saver_backlight());
    } else if (idle >= dim_at) {
        set_screen_level(SCREEN_DIM);
    } else {
        set_screen_level(SCREEN_ON);
    }
}

static void apply_timezone()
{
    setenv("TZ", timezones[tz_idx].posix, 1);
    tzset();
    ntp_requested = false; // Sync mit neuer Zone erneut anstossen
}

// ============================================================
// Zeilen-Bausteine
// ============================================================

lv_obj_t *settings_add_section(const char *title)
{
    lv_obj_t *lbl = ui_overline(settings_list, title);
    lv_obj_set_width(lbl, LV_PCT(100));
    lv_obj_set_style_pad_top(lbl, GAP_S, 0);
    lv_obj_set_style_pad_left(lbl, GAP_XS, 0);
    return lbl;
}

static lv_obj_t *row_base(int height)
{
    lv_obj_t *row = lv_obj_create(settings_list);
    lv_obj_set_size(row, LV_PCT(100), height);
    ui_card_style(row);
    lv_obj_set_style_pad_hor(row, GAP_L, 0);
    lv_obj_set_style_pad_ver(row, 0, 0);
    return row;
}

// Gemeinsamer Zeilenaufbau. sub_lbl_out liefert das Untertitel-Label zurueck,
// damit Zeilen ihren Wert spaeter aktualisieren koennen.
static lv_obj_t *row_create(const char *icon, const char *title, const char *subtitle,
                            lv_obj_t **sub_lbl_out)
{
    lv_obj_t *row = row_base(ROW_H);
    lv_obj_set_flex_flow(row, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(row, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

    if (icon) {
        lv_obj_t *ic = lv_label_create(row);
        lv_label_set_text(ic, icon);
        lv_obj_set_style_pad_right(ic, 14, 0);
    }

    // Textspalte: waechst, damit das Bedienelement rechts buendig sitzt
    lv_obj_t *text_col = lv_obj_create(row);
    lv_obj_set_height(text_col, LV_SIZE_CONTENT);
    lv_obj_set_flex_grow(text_col, 1);
    lv_obj_remove_flag(text_col, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_remove_flag(text_col, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_set_style_bg_opa(text_col, LV_OPA_TRANSP, 0);
    lv_obj_set_style_border_width(text_col, 0, 0);
    lv_obj_set_style_pad_all(text_col, 0, 0);
    lv_obj_set_flex_flow(text_col, LV_FLEX_FLOW_COLUMN);

    lv_obj_t *title_lbl = lv_label_create(text_col);
    lv_label_set_text(title_lbl, title);
    lv_obj_set_width(title_lbl, LV_PCT(100));
    lv_label_set_long_mode(title_lbl, LV_LABEL_LONG_DOT);

    lv_obj_t *sub_lbl = nullptr;
    if (subtitle) {
        sub_lbl = lv_label_create(text_col);
        lv_label_set_text(sub_lbl, subtitle);
        lv_obj_set_width(sub_lbl, LV_PCT(100));
        lv_label_set_long_mode(sub_lbl, LV_LABEL_LONG_DOT);
        lv_obj_set_style_text_font(sub_lbl, &bb_font_12, 0);
        lv_obj_set_style_text_color(sub_lbl, lv_color_hex(COL_MUTED), 0);
        lv_obj_set_style_pad_top(sub_lbl, 2, 0);
    }

    if (sub_lbl_out) *sub_lbl_out = sub_lbl;
    return row;
}

lv_obj_t *settings_add_row(const char *icon, const char *title, const char *subtitle)
{
    return row_create(icon, title, subtitle, nullptr);
}

lv_obj_t *settings_add_slider_row(const char *icon, const char *title,
                                  int32_t min, int32_t max, int32_t value,
                                  lv_event_cb_t cb, lv_obj_t **value_lbl_out)
{
    lv_obj_t *row = row_base(SLIDER_ROW_H);

    lv_obj_t *icon_lbl = nullptr;
    if (icon) {
        icon_lbl = lv_label_create(row);
        lv_label_set_text(icon_lbl, icon);
        lv_obj_align(icon_lbl, LV_ALIGN_TOP_LEFT, 0, 16);
    }

    lv_obj_t *title_lbl = lv_label_create(row);
    lv_label_set_text(title_lbl, title);
    lv_obj_align(title_lbl, LV_ALIGN_TOP_LEFT, icon ? 34 : 0, 16);

    lv_obj_t *value_lbl = lv_label_create(row);
    lv_obj_set_style_text_color(value_lbl, lv_color_hex(COL_MUTED), 0);
    lv_obj_align(value_lbl, LV_ALIGN_TOP_RIGHT, 0, 16);

    // Slider ueber die volle Zeilenbreite — auf einem Touchscreen ist ein
    // schmaler Regler neben dem Text kaum zu treffen.
    lv_obj_t *slider = lv_slider_create(row);
    lv_slider_set_range(slider, min, max);
    lv_slider_set_value(slider, value, LV_ANIM_OFF);
    lv_obj_set_width(slider, LV_PCT(100));
    lv_obj_align(slider, LV_ALIGN_BOTTOM_MID, 0, -18);
    lv_obj_add_event_cb(slider, cb, LV_EVENT_VALUE_CHANGED, nullptr);

    if (value_lbl_out) *value_lbl_out = value_lbl;
    return slider;
}

