rico001/bambuddy-screen-4848S040CI-esp32/src/settings_screen.cpp
    // Chevron signalisiert: hier oeffnet sich etwas
    lv_obj_t *chevron = lv_label_create(row);
    lv_label_set_text(chevron, LV_SYMBOL_RIGHT);
    lv_obj_set_style_text_color(chevron, lv_color_hex(COL_MUTED), 0);
    lv_obj_set_style_pad_left(chevron, 10, 0);

    refresh_value_label(idx);
    return row;
}

// ============================================================
// Web-Update
// ============================================================

// Die Zeile sagt, wo der Dienst zu erreichen ist — eine Adresse, die man erst
// im Router suchen muss, waere die halbe Auskunft. Waehrend eines Uploads
// steht stattdessen der Fortschritt dort: Der Browser zeigt zwar seinen
// eigenen Balken, aber wer vor dem Geraet steht, sieht sonst nur ein
// flackerndes Display und weiss nicht, ob das gewollt ist.
static void refresh_ota_row()
{
    if (!ota_row_lbl) return;

    const int pct = ota_service_progress();
    if (pct >= 0) {
        lv_label_set_text_fmt(ota_row_lbl, "Update läuft: %d %%", pct);
        lv_obj_set_style_text_color(ota_row_lbl, lv_color_hex(COL_ACCENT), 0);
        return;
    }

    if (!ota_service_enabled()) {
        lv_label_set_text(ota_row_lbl, "Firmware im Browser aufspielen");
        lv_obj_set_style_text_color(ota_row_lbl, lv_color_hex(COL_MUTED), 0);
        return;
    }

    if (ota_service_online()) {
        lv_label_set_text(ota_row_lbl, ota_service_address());
        lv_obj_set_style_text_color(ota_row_lbl, lv_color_hex(COL_OK), 0);
        return;
    }

    const char *msg = ota_service_message();
    lv_label_set_text(ota_row_lbl, msg[0] ? msg : "Wartet auf WLAN");
    lv_obj_set_style_text_color(ota_row_lbl, lv_color_hex(COL_MUTED), 0);
}

// ============================================================
// NTP
// ============================================================

static void time_tick_cb(lv_timer_t *)
{
    refresh_ota_row();

    const bool online = (WiFi.status() == WL_CONNECTED);
    const time_t now = time(nullptr);
    const bool valid = now >= MIN_VALID_EPOCH;

    if (online && !valid) {
        const uint32_t ms = millis();
        if (!ntp_requested || (ms - last_ntp_attempt_ms) >= NTP_RETRY_MS) {
            configTzTime(timezones[tz_idx].posix,
                         "de.pool.ntp.org", "pool.ntp.org", "time.nist.gov");
            ntp_requested = true;
            last_ntp_attempt_ms = ms;
            Serial.println("[Settings] NTP-Sync angefordert");
        }
    }

    if (!time_row_lbl) return;

    if (valid) {
        struct tm local_tm;
        localtime_r(&now, &local_tm);
        char buf[48];
        strftime(buf, sizeof(buf), "%d.%m.%Y  %H:%M:%S", &local_tm);
        lv_label_set_text(time_row_lbl, buf);
        lv_obj_set_style_text_color(time_row_lbl, lv_color_hex(COL_OK), 0);
    } else {
        lv_label_set_text(time_row_lbl, online ? "Synchronisiere ..." : "Wartet auf WLAN");
        lv_obj_set_style_text_color(time_row_lbl, lv_color_hex(COL_MUTED), 0);
    }
}

// Uhr und Bildschirmabschaltung laufen unabhaengig davon, ob der
// Einstellungs-Screen jemals gebaut wurde — beide gehoeren zum Geraet,
// nicht zu einer Kachel.
static void start_background_services()
{
    if (!sleep_timer) {
        sleep_timer = lv_timer_create(sleep_check_cb, 500, nullptr);
        lv_timer_set_repeat_count(sleep_timer, -1);
    }

    if (!time_timer) {
        time_timer = lv_timer_create(time_tick_cb, 1000, nullptr);
        lv_timer_set_repeat_count(time_timer, -1);
    }
    time_tick_cb(nullptr);
}

// ============================================================
// Callbacks
// ============================================================

// Farbschema wechseln heisst neu starten.
//
// Die Screens tragen ihre Farben seit dem Redesign in den Objekten — Karten,
// Raender, Pillen. Ein Themenwechsel zur Laufzeit faerbt nur, was LVGL selbst
// verwaltet, und liesse den Rest im alten Schema stehen. Ein halb umgefaerbter
// Bildschirm sieht kaputt aus; ein angekuendigter Neustart nicht.
static void dark_restart_async(void *)
{
    // Ausstehende Protokolleintraege sichern, bevor der Strom des Programms
    // abreisst — derselbe Weg wie beim Neustart-Knopf im System-Screen.
    bambuddy_hms_flush_now();
    delay(300);
    ESP.restart();
}

static void dark_restart_confirmed(void *)
{
    dark_mode = !dark_mode;
    save_settings();

    // Asynchron: Der Aufruf kommt aus dem Klick-Callback des Dialogs, und der
    // raeumt sich danach noch selbst ab.
    lv_async_call(dark_restart_async, nullptr);
}

// Farbe gewaehlt: speichern und neu starten — wie beim Farbschema. Die
// Screens tragen ihre Farben in den Objekten, ein Wechsel zur Laufzeit
// faerbte nur die Haelfte.
static void primary_restart_async(void *)
{
    bambuddy_hms_flush_now();
    delay(300);
    ESP.restart();
}

static void primary_picked(uint32_t rgb, void *)
{
    if (rgb == primary_color) return;

    primary_color = rgb;
    save_settings();

    if (primary_swatch) ui_set_bg_color(primary_swatch, rgb);
    lv_async_call(primary_restart_async, nullptr);
}

static void primary_row_cb(lv_event_t *)
{
    if (ui_color_picker_is_open()) return;
    ui_color_picker_open("Akzentfarbe", primary_color, primary_picked, nullptr);
}

static void dark_switch_cb(lv_event_t *)
{
    // Schalter zuruecksetzen: Erst der Neustart macht die Wahl wahr, und bis
    // dahin soll er nicht das Gegenteil des Sichtbaren behaupten.
    const bool wanted = lv_obj_has_state(dark_switch, LV_STATE_CHECKED);
    if (wanted == dark_mode) return;

    if (dark_mode) {
        lv_obj_add_state(dark_switch, LV_STATE_CHECKED);
    } else {
        lv_obj_remove_state(dark_switch, LV_STATE_CHECKED);
    }

    ui_confirm(wanted ? "Auf dunkel umstellen?" : "Auf hell umstellen?",
               "Das Farbschema gilt ab dem naechsten Start. Das Display "
               "startet dazu sofort neu.",
               "Abbrechen", "Umstellen", COL_ACCENT, dark_restart_confirmed, nullptr);
}

static void tls_switch_cb(lv_event_t *)
{
    tls_verify = lv_obj_has_state(tls_switch, LV_STATE_CHECKED);
    save_settings();
    Serial.printf("[Settings] TLS-Pruefung: %s\n", tls_verify ? "an" : "AUS");
}

