rico001/bambuddy-screen-4848S040CI-esp32/src/settings_screen.cpp
    lv_obj_t *saver_row = settings_add_row(LV_SYMBOL_EYE_OPEN, "Bildschirmschoner",
                                           "Statt abschalten die Uhr zeigen");
    saver_dd = lv_dropdown_create(saver_row);
    lv_dropdown_set_options(saver_dd, saver_options);
    lv_dropdown_set_selected(saver_dd, saver_idx);
    lv_obj_set_width(saver_dd, 150);
    lv_obj_add_event_cb(saver_dd, saver_dd_cb, LV_EVENT_VALUE_CHANGED, nullptr);

    brightness_slider = settings_add_slider_row(LV_SYMBOL_SETTINGS, "Helligkeit",
                                                0, 100, brightness,
                                                brightness_cb, &brightness_value_lbl);
    lv_label_set_text_fmt(brightness_value_lbl, "%d%%", 20 + brightness * 80 / 100);

    // --- Bambuddy-Verbindung ---
    settings_add_section("BAMBUDDY");

    settings_add_text_row(LV_SYMBOL_HOME, "Server-URL",
                          bambuddy_configured_base_url, bambuddy_set_base_url, false,
                          false);

    settings_add_text_row(LV_SYMBOL_EYE_CLOSE, "API-Key",
                          bambuddy_api_key, bambuddy_set_api_key, true, false);

    settings_add_text_row(LV_SYMBOL_LIST, "Drucker-ID",
                          printer_id_get, bambuddy_set_printer_id, false, true);

    settings_add_text_row(LV_SYMBOL_VIDEO, "Kamera-Token",
                          bambuddy_cam_token, bambuddy_set_cam_token, true, false);

    lv_obj_t *poll_row = settings_add_row(LV_SYMBOL_REFRESH, "Aktualisierung",
                                          "Im Leerlauf automatisch seltener");
    poll_dd = lv_dropdown_create(poll_row);
    lv_dropdown_set_options(poll_dd, poll_options);
    lv_dropdown_set_selected(poll_dd, poll_idx);
    lv_obj_set_width(poll_dd, 150);
    lv_obj_add_event_cb(poll_dd, poll_dd_cb, LV_EVENT_VALUE_CHANGED, nullptr);

    lv_obj_t *tls_row = settings_add_row(LV_SYMBOL_WARNING, "Zertifikat prüfen",
                                         "Nur zum Debuggen abschalten");
    tls_switch = lv_switch_create(tls_row);
    lv_obj_set_size(tls_switch, 58, 32);
    if (tls_verify) lv_obj_add_state(tls_switch, LV_STATE_CHECKED);
    lv_obj_add_event_cb(tls_switch, tls_switch_cb, LV_EVENT_VALUE_CHANGED, nullptr);

    lv_obj_t *guard_row =
        settings_add_row(LV_SYMBOL_WARNING, "Druckstart blockieren",
                         "Start des Drucks blockieren, wenn Drucker beschäftigt.");
    guard_switch = lv_switch_create(guard_row);
    lv_obj_set_size(guard_switch, 58, 32);
    if (start_guard) lv_obj_add_state(guard_switch, LV_STATE_CHECKED);
    lv_obj_add_event_cb(guard_switch, guard_switch_cb, LV_EVENT_VALUE_CHANGED, nullptr);

    // --- MQTT ---
    settings_add_section("MQTT");

    lv_obj_t *source_row = settings_add_row(LV_SYMBOL_SHUFFLE, "Status per MQTT",
                                            "Aus: Status wird per HTTP abgefragt");
    lv_obj_t *source_switch = lv_switch_create(source_row);
    lv_obj_set_size(source_switch, 58, 32);
    if (bambuddy_source_mqtt()) lv_obj_add_state(source_switch, LV_STATE_CHECKED);
    lv_obj_add_event_cb(source_switch, source_switch_cb, LV_EVENT_VALUE_CHANGED, nullptr);

    settings_add_text_row(LV_SYMBOL_WIFI, "Broker",
                          bambuddy_mqtt_host, bambuddy_set_mqtt_host, false, false);

    settings_add_text_row(LV_SYMBOL_DOWNLOAD, "Port",
                          mqtt_port_get, bambuddy_set_mqtt_port, false, true);

    settings_add_text_row(LV_SYMBOL_USB, "Benutzer",
                          bambuddy_mqtt_user, bambuddy_set_mqtt_user, false, false);

    settings_add_text_row(LV_SYMBOL_EYE_CLOSE, "Passwort",
                          bambuddy_mqtt_pass, bambuddy_set_mqtt_pass, true, false);

    settings_add_text_row(LV_SYMBOL_LIST, "Status-Topic",
                          bambuddy_mqtt_topic, bambuddy_set_mqtt_topic, false, false);

    // --- Protokoll ---
    settings_add_section("MELDUNGEN");

    struct log_row_t {
        const char *icon;
        const char *title;
        const char *subtitle;
        bool *value;
        lv_obj_t **handle;
    };

    const log_row_t log_rows[] = {
        {LV_SYMBOL_PLAY, "Druckstart", "Beginn eines Auftrags vermerken",
         &log_print_start, &log_start_switch},
        {LV_SYMBOL_OK, "Druck fertig", "Fertige Drucke vermerken", &log_print_done,
         &log_done_switch},
        {LV_SYMBOL_WARNING, "Fehler", "Druckerfehler und Abbrüche vermerken",
         &log_errors, &log_error_switch},
        {LV_SYMBOL_POWER, "Systemstart", "Neustarts des Displays vermerken", &log_boot,
         &log_boot_switch},
        {LV_SYMBOL_SAVE, "Dauerhaft speichern", "Aus: kein Flimmern, aber weg nach Neustart",
         &log_persist, &log_persist_switch},
    };

    for (const log_row_t &row : log_rows) {
        lv_obj_t *parent_row = settings_add_row(row.icon, row.title, row.subtitle);
        lv_obj_t *sw = lv_switch_create(parent_row);
        lv_obj_set_size(sw, 58, 32);
        if (*row.value) lv_obj_add_state(sw, LV_STATE_CHECKED);
        lv_obj_add_event_cb(sw, log_switch_cb, LV_EVENT_VALUE_CHANGED, row.value);
        *row.handle = sw;
    }

    // --- Zeit ---
    settings_add_section("ZEIT");

    lv_obj_t *tz_row = settings_add_row(LV_SYMBOL_GPS, "Zeitzone",
                                        "Sommerzeit wird automatisch umgestellt");
    tz_dd = lv_dropdown_create(tz_row);
    lv_dropdown_set_options(tz_dd, tz_options);
    lv_dropdown_set_selected(tz_dd, tz_idx);
    lv_obj_set_width(tz_dd, 150);
    lv_obj_add_event_cb(tz_dd, tz_dd_cb, LV_EVENT_VALUE_CHANGED, nullptr);

    // Untertitel dieser Zeile dient als Sync-Statusanzeige
    row_create(LV_SYMBOL_BELL, "Uhrzeit", "", &time_row_lbl);

    // --- Firmware ---
    //
    // Ganz unten: Ein Schalter, der einen Upload-Weg ins Geraet oeffnet, soll
    // nicht neben der Helligkeit liegen, wo man ihn im Vorbeiwischen trifft.
    settings_add_section("FIRMWARE");

    lv_obj_t *ota_row = row_create(LV_SYMBOL_DOWNLOAD, "Web-Update", "", &ota_row_lbl);
    ota_switch = lv_switch_create(ota_row);
    lv_obj_set_size(ota_switch, 58, 32);
    if (ota_web) lv_obj_add_state(ota_switch, LV_STATE_CHECKED);
    lv_obj_add_event_cb(ota_switch, ota_switch_cb, LV_EVENT_VALUE_CHANGED, nullptr);

    time_tick_cb(nullptr);
}

void settings_screen_destroy()
{
    if (edit_overlay) {
        lv_obj_delete(edit_overlay);
        edit_overlay = nullptr;
    }

    settings_list = nullptr;
    dark_switch = nullptr;
    tls_switch = nullptr;
    guard_switch = nullptr;
    log_start_switch = nullptr;
    log_done_switch = nullptr;
    log_error_switch = nullptr;
    log_boot_switch = nullptr;
    log_persist_switch = nullptr;
    poll_dd = nullptr;
    tz_dd = nullptr;
    screen_off_dd = nullptr;
    saver_dd = nullptr;
    brightness_slider = nullptr;
    brightness_value_lbl = nullptr;
    time_row_lbl = nullptr;
    ota_switch = nullptr;
    ota_row_lbl = nullptr;
    primary_swatch = nullptr;
    edit_title = nullptr;
    edit_ta = nullptr;
    edit_kb = nullptr;
    edit_row_idx = -1;
    memset(text_rows, 0, sizeof(text_rows));
    text_row_count = 0;
}


uint32_t settings_poll_interval_ms() { return poll_intervals_ms[poll_idx]; }

uint32_t settings_poll_interval_idle_ms()
{
    const uint32_t idle = poll_intervals_ms[poll_idx] * 5;
    return idle > POLL_IDLE_MAX_MS ? POLL_IDLE_MAX_MS : idle;
}


bool settings_start_guard()
{
    return start_guard;
}

bool settings_log_print_start() { return log_print_start; }
bool settings_log_print_done() { return log_print_done; }
bool settings_log_errors() { return log_errors; }
bool settings_log_boot() { return log_boot; }
bool settings_log_persist() { return log_persist; }
bool settings_ota_web() { return ota_web; }

uint32_t settings_display_idle_ms()
{
    return lv_display_get_inactive_time(nullptr);
}

bool settings_log_any()
{
    return log_print_start || log_print_done || log_errors || log_boot;
}

bool settings_tls_verify() { return tls_verify; }

const char *settings_timezone() { return timezones[tz_idx].posix; }

bool settings_time_synced() { return time(nullptr) >= MIN_VALID_EPOCH; }
